test/CubitToOpenFoam/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v3.0+                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

//Author: Simon Rush
//Date: 04/29/16
FoamFile
{
    version     3.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    topBottom
    {
 	type 		zeroGradient;
    }
    outlet
    {
 	type 		fixedValue;
	value 		uniform 0;
    }
    inlet
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
